import type { HistoryPhrases } from "../history-patterns";
export const phrases: HistoryPhrases = {
  events: ("マラトンの戦い|アメリカ独立宣言の採択|秦による中国統一|トルデシリャス条約の締結|ボイジャー1号の打ち上げ|西ローマ帝国の滅亡|ノルマン人によるイングランド征服|ロンドン大火の発生|ストックトン・ダーリントン鉄道の開業|アテネでの最初の近代オリンピック|ハングルの公布|朝鮮王朝の建国|高麗の建国|文禄・慶長の役の開始|朝鮮戦争休戦協定の締結|ロゼッタ・ストーンの発見|コロンブスの最初の大西洋航海|フランス第一共和政の宣言|スエズ運河の開通|米国初の大陸横断鉄道の完成|メシカ人によるテノチティトランの建設|パルテノン神殿の建設|コロッセオの建設|マチュ・ピチュの建設|万里の長城の建設|ライト兄弟の初飛行|国際連合の創設|世界人権宣言の採択|スプートニク1号の打ち上げ|ユーリ・ガガーリンの初の有人宇宙飛行|明治維新の開始|ハイチ革命の開始|インドの独立|オスマン帝国によるコンスタンティノープル征服|ワーテルローの戦い|第一次世界大戦の開始|ジェームズタウン入植地の建設|ヴェルサイユ条約の調印|第一次世界大戦西部戦線の休戦|ルナ2号の月到達").split("|"),
  places: ["古代ギリシャ","古代ローマ","インカ","中国"],
  when: (event) => `${event}はいつ起こりましたか？`, where: (event) => `${event}はどこで行われましたか？`, who: (event) => `${event}を行った文明は何ですか？`,
  whenWhy: (event,date) => `${event}が起こったのは ${date} です。`, whereWhy: (event,place) => `${event}は${place}で行われました。`, whoWhy: (event,people) => `${event}を行ったのは${people}です。`,
};
