import type { HistoryPhrases } from "../history-patterns";
export const phrases: HistoryPhrases = {
  events: ("馬拉松戰役|美國獨立宣言的通過|秦統一中國|托爾德西里亞斯條約的簽訂|航海家1號發射|西羅馬帝國滅亡|諾曼征服英格蘭|倫敦大火爆發|斯托克頓—達靈頓鐵路通車|雅典舉辦首屆現代奧運會|韓文頒布|朝鮮王朝建立|高麗王朝建立|壬辰倭亂開始|韓戰停戰協定簽署|羅塞塔石碑被發現|哥倫布首次橫渡大西洋|法蘭西第一共和國宣告成立|蘇伊士運河通航|美國首條橫貫大陸鐵路完工|墨西加人建立特諾奇蒂特蘭|帕德嫩神廟建造|羅馬競技場建造|馬丘比丘建造|萬里長城修建|萊特兄弟首次動力飛行|聯合國成立|世界人權宣言通過|史普尼克1號發射|尤里·加加林首次載人太空飛行|明治維新開始|海地革命開始|印度獨立|鄂圖曼帝國攻占君士坦丁堡|滑鐵盧戰役|第一次世界大戰爆發|詹姆斯敦殖民地建立|凡爾賽條約簽訂|第一次世界大戰西線停戰|月球2號抵達月球").split("|"),
  places: ["古希臘","古羅馬","印加文明","中國"],
  when: (event) => `${event}發生於何時？`, where: (event) => `${event}發生於何地？`, who: (event) => `哪個文明完成了${event}？`,
  whenWhy: (event,date) => `${event}發生於${date}。`, whereWhy: (event,place) => `${event}發生於${place}。`, whoWhy: (event,people) => `${event}由${people}完成。`,
};
