import type { SciencePhrases } from "../science-patterns";
export const phrases: SciencePhrases = {
  answers: ("O|Au|Na|Fe|C|葡萄糖|氧氣|細胞核|DNA|血小板|7|牛頓|安培|焦耳|摩擦力|土星|水星|月球|主序星|銀河系|瓦特|蒸發|岩漿|熔岩|地函|瞳孔|維生素D|皮膚|腎臟|氣管|帕斯卡|原子|正電荷|不帶電|古生物學|莫氏硬度|昇華|平流層|彈性位能|頻率").split("|"),
  facts: ("氧元素的化學符號是___。|金元素的化學符號是___。|鈉元素的化學符號是___。|鐵元素的化學符號是___。|碳元素的化學符號是___。|植物透過光合作用產生的糖是___。|光合作用釋放的氣體是___。|真核細胞的大部分DNA位於___。|攜帶遺傳資訊的分子是___。|幫助血液凝固的成分是___。|室溫下中性純水的pH約為___。|力的國際單位是___。|電流的國際單位制基本單位是___。|能量的國際單位是___。|阻礙接觸面相對運動的力是___。|擁有最顯著行星環的行星是___。|最靠近太陽的行星是___。|地球的天然衛星是___。|太陽屬於___。|太陽系所在的星系是___。|功率的國際單位是___。|液體從表面變為氣體的過程稱為___。|地表以下的熔融岩石稱為___。|到達地表的熔融岩石稱為___。|地球最厚的一層是___。|眼睛中透過改變大小調節入光量的部位是___。|皮膚受日光照射後可合成___。|人體最大的器官是___。|過濾血液並形成尿液的器官是___。|將空氣從咽喉送往肺部的管道是___。|壓力的國際單位是___。|保持元素化學性質的最小單位是___。|質子帶___。|中子處於___的狀態。|研究化石所反映的古代生命的學科是___。|比較礦物抗刮能力的量表是___。|固體不經液態直接變為氣體稱為___。|大部分臭氧層位於___。|拉伸的彈簧儲存的能量是___。|以赫茲為單位測量的波動性質是___。").split("|"),
};
