import type { HistoryPhrases } from "../history-patterns";
export const phrases: HistoryPhrases = {
  events: ("马拉松战役|美国独立宣言的通过|秦统一中国|托尔德西里亚斯条约的签订|旅行者1号发射|西罗马帝国灭亡|诺曼征服英格兰|伦敦大火爆发|斯托克顿—达灵顿铁路开通|雅典举办首届现代奥运会|谚文颁布|朝鲜王朝建立|高丽王朝建立|壬辰倭乱开始|朝鲜战争停战协定签署|罗塞塔石碑被发现|哥伦布首次横渡大西洋|法兰西第一共和国宣告成立|苏伊士运河开通|美国首条横贯大陆铁路建成|墨西加人建立特诺奇蒂特兰|帕特农神庙建造|罗马斗兽场建造|马丘比丘建造|万里长城修建|莱特兄弟首次动力飞行|联合国成立|世界人权宣言通过|斯普特尼克1号发射|尤里·加加林首次载人航天飞行|明治维新开始|海地革命开始|印度独立|奥斯曼帝国攻占君士坦丁堡|滑铁卢战役|第一次世界大战爆发|詹姆斯敦定居点建立|凡尔赛条约签订|第一次世界大战西线停战|月球2号抵达月球").split("|"),
  places: ["古希腊","古罗马","印加文明","中国"],
  when: (event) => `${event}发生于何时？`, where: (event) => `${event}发生于何地？`, who: (event) => `哪个文明完成了${event}？`,
  whenWhy: (event,date) => `${event}发生于${date}。`, whereWhy: (event,place) => `${event}发生于${place}。`, whoWhy: (event,people) => `${event}由${people}完成。`,
};
