import type { SciencePhrases } from "../science-patterns";
export const phrases: SciencePhrases = {
  answers: ("O|Au|Na|Fe|C|葡萄糖|氧气|细胞核|DNA|血小板|7|牛顿|安培|焦耳|摩擦力|土星|水星|月球|主序星|银河系|瓦特|蒸发|岩浆|熔岩|地幔|瞳孔|维生素D|皮肤|肾脏|气管|帕斯卡|原子|正电荷|不带电|古生物学|莫氏硬度|升华|平流层|弹性势能|频率").split("|"),
  facts: ("氧元素的化学符号是___。|金元素的化学符号是___。|钠元素的化学符号是___。|铁元素的化学符号是___。|碳元素的化学符号是___。|植物通过光合作用产生的糖是___。|光合作用释放的气体是___。|真核细胞的大部分DNA位于___。|携带遗传信息的分子是___。|帮助血液凝固的成分是___。|室温下中性纯水的pH约为___。|力的国际单位是___。|电流的国际单位制基本单位是___。|能量的国际单位是___。|阻碍接触面相对运动的力是___。|拥有最显著行星环的行星是___。|最靠近太阳的行星是___。|地球的天然卫星是___。|太阳属于___。|太阳系所在的星系是___。|功率的国际单位是___。|液体从表面变为气体的过程叫___。|地表以下的熔融岩石叫___。|到达地表的熔融岩石叫___。|地球最厚的一层是___。|眼睛中通过改变大小调节入光量的部位是___。|皮肤受日光照射后可合成___。|人体最大的器官是___。|过滤血液并形成尿液的器官是___。|将空气从咽喉送向肺部的管道是___。|压力的国际单位是___。|保持元素化学性质的最小单位是___。|质子带___。|中子处于___的状态。|研究化石所反映的古代生命的学科是___。|比较矿物抗刻划能力的量表是___。|固体不经过液态直接变为气体叫___。|大部分臭氧层位于___。|拉伸的弹簧储存的能量是___。|以赫兹为单位测量的波动性质是___。").split("|"),
};
