import type { HistoryPhrases } from "../history-patterns";
export const phrases: HistoryPhrases = {
  events: ("마라톤 전투|미국 독립선언서 채택|진나라의 중국 통일|토르데시야스 조약 체결|보이저 1호 발사|서로마 제국 멸망|노르만인의 잉글랜드 정복|런던 대화재 시작|스톡턴·달링턴 철도 개통|아테네에서 열린 첫 근대 올림픽|훈민정음 반포|조선 건국|고려 건국|임진왜란 시작|한국전쟁 정전협정 체결|로제타석 발견|콜럼버스의 첫 대서양 항해|프랑스 제1공화국 선포|수에즈 운하 개통|미국 최초의 대륙횡단철도 완공|멕시카족의 테노치티틀란 건설|파르테논 신전 건설|콜로세움 건설|마추픽추 건설|만리장성 건설|라이트 형제의 첫 동력 비행|국제연합 창설|세계 인권 선언 채택|스푸트니크 1호 발사|유리 가가린의 첫 유인 우주비행|메이지 유신 시작|아이티 혁명 시작|인도 독립|오스만 제국의 콘스탄티노폴리스 정복|워털루 전투|제1차 세계대전 시작|제임스타운 정착지 건설|베르사유 조약 체결|제1차 세계대전 서부 전선 휴전|루나 2호의 달 도착").split("|"),
  places: ["고대 그리스","고대 로마","잉카 문명","중국"],
  when: (event) => `${event}은 언제 일어났나요?`, where: (event) => `${event}은 어디에서 이루어졌나요?`, who: (event) => `${event}을 이룬 문명은 무엇인가요?`,
  whenWhy: (event,date) => `${event}의 시기는 ${date}입니다.`, whereWhy: (event,place) => `${event}은 ${place}에서 이루어졌습니다.`, whoWhy: (event,people) => `${event}을 이룬 문명은 ${people}입니다.`,
};
